kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_DAC1_Init();
  MX_I2C2_Init();
  MX_SPI1_Init();
  MX_TIM2_Init();
  MX_TIM6_Init();
  MX_USART2_UART_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */

  //-----------------------------------------------------------------------------//
  // Set DAC output to mid-level (silence) before starting
  //-----------------------------------------------------------------------------//

  Set_DAC_Output_To_Midlevel(&hdac1, 2048);

  //-----------------------------------------------------------------------------//
  // Initialize UART logging
  //-----------------------------------------------------------------------------//

  LOGF("\r\n");
  LOGF("UART boot OK\r\n");
  HAL_Delay(200);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  //-----------------------------------------------------------------------------//
  // Check battery voltage and go back to sleep if low
  //-----------------------------------------------------------------------------//

  is_battery_low(&hadc1);

  //-----------------------------------------------------------------------------//
  // Get DAC sample rate and log it
  //-----------------------------------------------------------------------------//

  uint32_t dac_sample_rate = get_dac_sample_rate_hz();
  LOGF("DAC sample rate: %lu Hz\r\n", (unsigned long)dac_sample_rate);

  //-----------------------------------------------------------------------------//
  // Indicate boot complete with LED blinks
  //-----------------------------------------------------------------------------//

  LED_BlinkStatusCode(STATUS_CODE_OK); // code 0 = "0000" = 4 short blinks

  //-----------------------------------------------------------------------------//
  // Find and set FSK frequencies based on user config and sample count
  // requirements
  //-----------------------------------------------------------------------------//

  freq_pair = find_frequency_pair(dac_sample_rate);

  LOGF("Frequency pair: lower=%u Hz, higher=%u Hz\r\n",
       (unsigned int)freq_pair.lower_freq, (unsigned int)freq_pair.higher_freq);
  LOGF("--------------------------\r\n");

  //-----------------------------------------------------------------------------//
  // Prepare sine wave lookup tables
  //-----------------------------------------------------------------------------//

  if (init_luts_from_freqpair() != 0) {
    LOGF("LUT alloc failed\r\n");
    LOGF("--------------------------\r\n");
    // Error_Handler_Code(STATUS_CODE_LUT_ALLOC_FAIL);
  }

  get_sineval_low();
  get_sineval_high();
  get_dc_mid();

  //-----------------------------------------------------------------------------//
  // Initialize RTC
  //-----------------------------------------------------------------------------//

  DS3231_PowerOn();
  if (HAL_I2C_IsDeviceReady(&hi2c2, DS3231_ADDR, 3, 100) == HAL_OK) {
    DS3231_Init();
    Set_Time(INITIAL_SEC, INITIAL_MIN, INITIAL_HOUR, INITIAL_DOW, INITIAL_DOM,
             INITIAL_MONTH, INITIAL_YEAR);
  }
  Get_Time(&now);
  LOGF("-------------------------\r\n");

  //-----------------------------------------------------------------------------//
  // Initialize radio
  //-----------------------------------------------------------------------------//

  HAL_Delay(20);
  int8_t init_result = init_radio(RX_MODE);
  if (init_result != 0) {
    LOGF("Failed to initialize radio in RX mode, error code: %d\r\n",
         init_result);
    LOGF("--------------------------\r\n");
    // Error_Handler_Code(init_result);
  }

  //-----------------------------------------------------------------------------//
  // Configure RX or TX mode
  //-----------------------------------------------------------------------------//

  if (RX_MODE) {
    turn_off_relay();
  }

  //-----------------------------------------------------------------------------//
  // Main loop
  //-----------------------------------------------------------------------------//

  LOGF("Entering main loop...\r\n");

  while (1) {

    // // 2) Debounce button
    // while (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7) == GPIO_PIN_RESET) {
    // }
    // __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_7);

    // For testing without button: just delay for a few seconds to simulate
    // sleep
    // HAL_Delay(5000);

    uint32_t wake_tick = HAL_GetTick();

    LOGF("Woke up!\r\n");

    Get_Time(&now);

    // 3) Check state and either start RX or TX
    if (RX_MODE) {
      // RX mode: read from radio and store in string
      read_RX(transmission, sizeof(transmission));
      LOGF("Received transmission: ");
      for (size_t i = 0; i < sizeof(transmission); i++) {
        LOGF("%02X ", transmission[i]);
      }
      LOGF("\r\n");

      // Process received transmission (e.g. parse bytes, convert RSSI to dBm,
      // etc.)
      process_transmission(transmission, &dBm_value);

      LOGF("Processed transmission into %s\r\n", transmission);
      LOGF("dBm value: %d\r\n", dBm_value);

      // Create output string based on received data and dBm value (e.g.
      // "/TIM.../STR.../DID.../LOC.../TMP...")
      uint8_t output_str[256] = {0};
      create_string_from_received_data(transmission, dBm_value, output_str,
                                       sizeof(output_str));

      LOGF("Created output string: %s\r\n", output_str);
      size_t payload_len = strlen((char *)output_str);
      LOGF("Output string length: %lu characters\r\n",
           (unsigned long)payload_len);

