kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
      if (USE_REED_SOLOMON_ERROR_CORRECTION) {
        // Prepare buffer for Reed-Solomon codeword (message + parity)
        uint8_t codeword[payload_len + RS_ERROR_CORRECTION_SYMBOLS];
        memset(codeword, 0, sizeof(codeword));

        // Encode the output string using Reed-Solomon
        rs_encode_msg((const uint8_t *)output_str, (int)payload_len, codeword,
                      RS_ERROR_CORRECTION_SYMBOLS);

        LOGF("Reed-Solomon encoded codeword: ");
        for (size_t i = 0; i < payload_len + RS_ERROR_CORRECTION_SYMBOLS; i++) {
          LOGF("%02X ", codeword[i]);
        }
        LOGF("\r\n");

        // Set output_str to the codeword for transmission (truncated to fit if
        // necessary)
        size_t codeword_len = payload_len + RS_ERROR_CORRECTION_SYMBOLS;
        if (codeword_len > sizeof(output_str)) {
          codeword_len = sizeof(output_str);
        }
        memcpy(output_str, codeword, codeword_len);
        payload_len = codeword_len;
        LOGF("Using Reed-Solomon codeword for transmission, length: %lu "
             "bytes\r\n",
             (unsigned long)payload_len);
      }

      // Make bitstream from output string
      make_bitstream_from_bytes(output_str, payload_len);
      LOGF("Prepared bitstream from output string.\r\n");
      LOGF("Output string length: %lu characters\r\n",
           (unsigned long)payload_len);

      // Calculate active duration based on bitstream length and bit durations
      size_t bitstream_len = 1u + payload_len * 8u + 8u;
      // LOGF("Bitstream: ");
      // for (size_t i = 0; i < bitstream_len; i++) {
      //   LOGF("%u", bitstream[i]);
      // }
      // LOGF("\r\n");
      calculate_active_duration_ms(bitstream_len);
      uint32_t total_ms = (uint32_t)(total_time * 1000.0f);
      LOGF("Calculated active duration for response: %lu ms\r\n",
           (unsigned long)total_ms);

      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);

      // Send transmission over audio
      LOGF("Starting transmission of response over audio...\r\n");

      Turn_On_Opamps(&hdac1);
      // LED_BlinkStatusCode(STATUS_CODE_STARTING_TRANSMISSION);
      turn_on_relay();

      TX_Start();

      // Wait for active window to complete (enters low-power sleep while
      // waiting)
      StartActiveWindowMs((uint32_t)(total_time * 1000.0f));

      uint32_t last_toggle = HAL_GetTick();
      while (!active_done) {
        uint32_t now = HAL_GetTick();
        if ((now - last_toggle) >= 100) { // blink every 100 ms
          last_toggle = now;
          LED_Toggle();
        }
        __WFI(); // CPU sleeps while DMA+TIM2+DAC run
      }
      active_done = 0;
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);

      // Stop transmission and go back to sleep
      TX_Stop();

    } else {
      // Send transmission over radio
      LOGF("Starting transmission over radio...\r\n");
      // LED_BlinkStatusCode(STATUS_CODE_STARTING_TRANSMISSION);
      start_TX();
    }

    // 4) Check battery voltage and go back to sleep if low
    is_battery_low(&hadc1);

    if (!RX_MODE) {

      uint32_t target_interval_s;

      if (USE_DEFAULT_INTERVAL_BETWEEN_REPEATS) {
        target_interval_s = 60;
      } else {
        target_interval_s = INTERVAL_BETWEEN_REPEATS_MINUTES * 60;
      }

      uint32_t elapsed_ms = HAL_GetTick() - wake_tick;
      uint32_t elapsed_s = elapsed_ms / 1000;

      uint32_t sleep_seconds;
      if (elapsed_s >= target_interval_s) {
        sleep_seconds = 1;
      } else {
        uint32_t remainder_ms = elapsed_ms % 1000;

        if (remainder_ms != 0) {
          HAL_Delay(1000 - remainder_ms);
        }

        static uint32_t cycle_count = 0;
        cycle_count++;

        if ((cycle_count % 4) == 0) {
          sleep_seconds = target_interval_s - elapsed_s - 2;
        } else {
          sleep_seconds = target_interval_s - elapsed_s - 3;
        }
      }

      LOGF("Elapsed awake time: %lu ms\r\n", (unsigned long)elapsed_ms);
      LOGF("Sleeping for %lu s\r\n", (unsigned long)sleep_seconds);

      LOGF("Going back to sleep...\r\n");

      RTC_SetWakeupTimer(sleep_seconds);
    }

    // 1) Enter STOP mode and wait for wakeup from EXTI (GPIOB Pin 7)
    LOGF("Entering STOP mode...\r\n");
    EnterStopMode();

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType =
      RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_LSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
  RCC_OscInitStruct.PLL.PLLN = 12;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV4;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK) {
    Error_Handler();
  }
}

/**
 * @brief ADC1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_ADC1_Init(void) {

  /* USER CODE BEGIN ADC1_Init 0 */

