kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  LOGF("  Peripherals stopped & DMA flags cleared\r\n");

  // Start DAC
  HAL_StatusTypeDef st;

  // Start DMA
  st = HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                         BUFFER_SIZE, DAC_ALIGN_12B_R);

  if (st != HAL_OK) {
    LOGF("  HAL_DAC_Start_DMA error: %d\r\n", st);
    // Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    LOGF("  HAL_DAC_Start_DMA OK\r\n");
  }

  // Ensure trigger enabled
  SET_BIT(DAC1->CR, DAC_CR_TEN1);

  // Start timer last
  __HAL_TIM_SET_COUNTER(&htim2, 0);
  st = HAL_TIM_Base_Start(&htim2);

  if (st != HAL_OK) {
    LOGF("  HAL_TIM_Base_Start error: %d\r\n", st);
    // Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    LOGF("  HAL_TIM_Base_Start OK\r\n");
  }
}

static void TX_Stop(void) {
  LOGF("TX_Stop()\r\n");

  tx_active = false;

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
  turn_off_relay();

  // Stop trigger + DMA first
  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  Turn_Off_Opamps(&hdac1);

  // Optional: if you want to *keep* the mid DC during STOP, leave DAC
  // running. If you want lowest power, stop it (output may go undefined
  // depending on buffer mode): HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);

  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  LOGF("  TX stopped cleanly (DAC set to mid)\r\n");
}

void string_to_hex(const char *str, uint8_t *hex_buf, size_t hex_buf_size) {
  size_t str_len = strlen(str);
  size_t max_bytes =
      (hex_buf_size < (str_len / 2)) ? hex_buf_size : (str_len / 2);

  for (size_t i = 0; i < max_bytes; i++) {
    sscanf(&str[i * 2], "%2hhx", &hex_buf[i]);
  }
}

void process_transmission(uint8_t *transmission, int *dBm_value) {
  size_t len = strlen((const char *)transmission);
  if (len <= 4) {
    LOGF("Transmission too short to process.\r\n");
    return;
  }

  for (size_t i = 0; i < len; i++) {
    LOGF("%02X ", transmission[i]);
  }
  LOGF("\r\n");

  uint8_t rssi_hex = transmission[len - 2]; // 2nd from end

  // LOGF("Extracted RSSI hex: %02X\r\n", rssi_hex);

  int8_t rssi_signed = (int8_t)rssi_hex; // 2's complement

  // LOGF("RSSI signed value: %d\r\n", rssi_signed);

  int rssi_dbm = (rssi_signed / 2) - 74; // integer dBm

  // LOGF("RSSI: %d dBm\r\n", rssi_dbm);

  dBm_value[0] = (int)rssi_dbm;

  // Create cleaned string: skip first 2 char, skip last 2 chars
  size_t cleaned_len = (len > 4) ? (len - 4) : 0;
  char cleaned_str[MAX_NUM_CHARS] = {0};
  if (cleaned_len > 0) {
    strncpy(cleaned_str, (const char *)transmission + 2, cleaned_len);
    cleaned_str[cleaned_len] = '\0'; // Null-terminate
  }

  // Overwrite the transmission parameter (cast needed for const)
  strncpy((char *)transmission, cleaned_str, MAX_NUM_CHARS - 1);
}

void create_string_from_received_data(const uint8_t *transmission,
                                      int dBm_value, uint8_t *output_str,
                                      size_t output_str_size) {
  if (!output_str || output_str_size == 0)
    return;

  // Clear the entire output string buffer to ensure no leftover data, and set
  // first char to null for safe concatenation
  memset(output_str, 0, output_str_size);
  output_str[0] = '\0';

  // Initialize with default values
  char user_string[64] = USER_STRING; // fallback from user_config.h
  int device_id = DEVICE_ID;          // fallback from user_config.h
  char location[64] = LOCATION;       // fallback from user_config.h
  int temperature = temp_int;         // runtime value
  rtc_time_t time_val = now;          // runtime value

  // Copy transmission to local buffer for tokenization
  char buf[256] = {0};
  size_t in_len = strnlen((const char *)transmission, sizeof(buf) - 1);
  memcpy(buf, transmission, in_len);
  buf[in_len] = '\0';

  // Parse tokens in the format /KEYvalue, where KEY is 3 chars and value is
  // variable length, separated by '/'
  for (char *tok = strtok((char *)buf, "/"); tok != NULL;
       tok = strtok(NULL, "/")) {
    if (strncmp(tok, "TIM", 3) == 0) {
      const char *p = tok + 3;
      if (strlen(p) >= 16) {
        char t[3] = {0};

        t[0] = p[0];
        t[1] = p[1];
        time_val.hours = (uint8_t)atoi(t);
        t[0] = p[2];
        t[1] = p[3];
        time_val.minutes = (uint8_t)atoi(t);
        t[0] = p[4];
        t[1] = p[5];
        time_val.seconds = (uint8_t)atoi(t);
        t[0] = p[6];
        t[1] = p[7];
        time_val.day = (uint8_t)atoi(t);
        t[0] = p[8];
        t[1] = p[9];
        time_val.date = (uint8_t)atoi(t);
        t[0] = p[10];
        t[1] = p[11];
        time_val.month = (uint8_t)atoi(t);

        char y[5] = {p[12], p[13], p[14], p[15], 0};
        time_val.year = (uint16_t)atoi(y);
      }
    } else if (strncmp(tok, "STR", 3) == 0) {
      strncpy(user_string, tok + 3, sizeof(user_string) - 1);
      user_string[sizeof(user_string) - 1] = '\0';

    } else if (strncmp(tok, "DID", 3) == 0) {
      device_id = atoi(tok + 3);

    } else if (strncmp(tok, "LOC", 3) == 0) {
      strncpy(location, tok + 3, sizeof(location) - 1);
      location[sizeof(location) - 1] = '\0';

    } else if (strncmp(tok, "TMP", 3) == 0) {
      temperature = atoi(tok + 3);
    }
  }

  // Build output string based on parsed tokens and compile-time flags, with
  // careful buffer management
  char temp_buf[256] = {0};
  size_t offset = 0;
  size_t remaining = sizeof(temp_buf);
  int n = 0;

  output_str[0] = '\0';

  if (INCLUDE_TIME) {
    n = snprintf(&temp_buf[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 time_val.hours, time_val.minutes, time_val.seconds,
                 time_val.day, time_val.date, time_val.month, time_val.year);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_USER_STRING) {
    n = snprintf(&temp_buf[offset], remaining, "/STR%s", user_string);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&temp_buf[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", device_id);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

