kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  if (INCLUDE_LOCATION) {
    n = snprintf(&temp_buf[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", location);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&temp_buf[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temperature);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Add termination slash
  if (strlen(temp_buf) > 0) {
    n = snprintf(&temp_buf[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Optional: append RSSI info for debug/logging
  // snprintf(&output_str[offset], remaining, " RSSI=%d dBm", dBm_value);

  // Hard guarantee null-termination
  output_str[output_str_size - 1] = '\0';

  // Copy ASCII bytes into uint8_t output buffer
  size_t out_len = strnlen(temp_buf, sizeof(temp_buf));
  if (out_len >= output_str_size) {
    out_len = output_str_size - 1;
  }

  memcpy(output_str, temp_buf, out_len);
  output_str[out_len] = 0x00;
}

static int init_luts_from_freqpair(void) {
  // frigjør hvis de finnes fra før
  free(sine_val_low);
  sine_val_low = NULL;
  free(sine_val_high);
  sine_val_high = NULL;
  free(dc_mid);
  dc_mid = NULL;

  sine_val_low = malloc(freq_pair.lower_freq_samples * sizeof(uint32_t));
  sine_val_high = malloc(freq_pair.higher_freq_samples * sizeof(uint32_t));
  dc_mid = malloc(freq_pair.lower_freq_samples * sizeof(uint32_t));

  if (!sine_val_low || !sine_val_high || !dc_mid) {
    free(sine_val_low);
    sine_val_low = NULL;
    free(sine_val_high);
    sine_val_high = NULL;
    free(dc_mid);
    dc_mid = NULL;
    return -1;
  }
  return 0;
}

void Error_Handler_Code(status_code_t code) {
  g_error_code = code;
  Error_Handler(); // call the CubeMX-compatible one
}

int _write(int file, char *ptr, int len) {
  (void)file;
  HAL_UART_Transmit(&huart2, (uint8_t *)ptr, len, 100);
  return len;
}

static void RTC_SetWakeupTimer(uint32_t seconds) {
  HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
  __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(&hrtc, RTC_FLAG_WUTF);

  if (seconds == 0) {
    seconds = 1;
  }

  if (HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, seconds - 1,
                                  RTC_WAKEUPCLOCK_CK_SPRE_16BITS) != HAL_OK) {
    Error_Handler_Code(STATUS_CODE_UNKNOWN_ERROR);
  }
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  LOGF("Error_Handler: code=%d\r\n", (int)g_error_code);

  // If you want it to repeat forever:
  LED_BlinkStatusCode((uint8_t)g_error_code);

  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
